//========================================================================================================================================================
// Задача 1. -->> Розробити додаток з такими маршрутами:
//					/season - повертає пору року
//					/day - повертає поточний день
//					/time - повертає час дня (ранок, обід, вечеря)
//========================================================================================================================================================

import express from 'express'
import { getCurrentSeason, getCurrentDay, getCurrentTime } from './utils.mjs'

const app = express()
const port = 3000

app.get('/', (req, res) => {
	res.send(`Hello, please select one of the routes : /season, /day, /time`)
})

app.get('/season', (req, res) => {
	res.send(`Current season is ${getCurrentSeason()}`)
})

app.get('/day', (req, res) => {
	res.send(`Current day is ${getCurrentDay()}`)
})

app.get('/time', (req, res) => {
	res.send(`Current time is ${getCurrentTime()}`)
})

//========================================================================================================================================================
app.listen(port, () => {
	console.log('Server is on');
})
//========================================================================================================================================================
